----用SQL语句完成下列任务：
----在图书信息表中，插入电子表格中第B31至B40行中的数据。
INSERT INTO Table_Read	VALUES
('TP391/61','7-81043-617-1','多媒体电脑中国家庭用户通','谭利民主编',1996.09,null,241550,273,'电子科技大学出版社','T','工业技术'),
('TP391.4/33','7-81012-690-3','PowerPoint for Windows 95 使用指南','张珑,张均宝编',1996.12,null,233300,190,'北京航空航天大学出版社','T','工业技术'),
('TP391/62','7-5053-3268-6','傻瓜多媒体与CD -- ROM','(美)Ardy Rathbone著',1997.05,null,345800,286,'电子工业出版社','T','工业技术'),
('C931.6/14','7-5624-0265-5','信息系统开发方法及原理','刘兆毓,朱庆生,谭强明编',1989.10,null,245130,191,'重庆大学出版社','C','社会科学总论'),
('TP391/59','7-5608-0833-6','IBM-PC汉字信息处理','郑邑,王建中编著',1991.12,null,224560,297,'同济大学出版社','T','工业技术'),
('TP391/60','7-5028-1029-3','电脑打字版式正误100例','赵方,谭永谦主编',1994.10,null,1994.10,148,'地震出版社','T','工业技术'),
('TP312BA/52','7-5357-1050-6','计算机基础','甘宪甫编著',1992.08,null,363300,212,'湖南科学技术出版社','T','工业技术'),
('TP316/68','7-5427-0475-3','PC—DOS 4.00磁盘操作系统技术参考手册 [专著] / 美国IBM公司著','美国IBM公司著',1991.05,null,458100,238,'上海科学普及出版社','T','工业技术'),
('TP316.7/14','7-302-00856-6','Windows 3.0用户指南','赵 海…[等]编译',1991.05,null,545600,336,'清华大学出版社','T','工业技术'),
('TP312dB/3a','7-302-01057-9','中文dBASE全自动编程系统Auto-dBASE原理及应用','刘祖照,龚宇,吴波编著',1992.08,'2版',458900,256,'清华大学出版社','T','工业技术');

----将书名为“计算机基础”的作者改为“甘利发”。
update dbo.Table_Read
set BookName='计算机基础'
where Author='甘利发'

----删除出版社是“清华大学出版社”的记录。
delete from dbo.Table_Read
where Publisher='清华大学出版社'